{
  "common": {
    "lang": "sv",
    "langFlag": "swedish.png",
    "langSelect": "På svenska",
    "logo": "logo.png",
    "contactInformation": "IT-Support för <a href=\"https://www.kth.se/student/it/contact\">studenter</a> och <a href=\"https://intra.kth.se/it\">anställda</a>.",
    "technicalInformation": "Teknisk information",
    "footer": ""
  },
  "errors": [
    {
      "type": "ERRORURL_CODE",
      "header": "Problem vid inloggning",
      "body": [ "Inloggning till tjänsten misslyckades. Se nedan för möjliga orsaker och åtgärder." ]
    },
    {
      "type": "IDENTIFICATION_FAILURE",
      "header": "Attribut saknas",
      "body": [
        "Tjänsten du försökte nå fick inte de attribut den behöver för att identifiera dig eller för att personanpassa tjänsten.",
        "Detta kan bero på att KTH saknar dessa uppgifter om dig eller att inloggningstjänsten på KTH inte är konfigurerat för att skicka attributen till tjänsten du försökte nå.",
        "Kontakta KTH IT-Support och ange vilken tjänst du försökte nå, vilka attribut som saknades om du vet vilka dessa är (tjänsten kan ha berättat detta för er) samt, om möjligt, en skärmdump med eventuella felmeddelanden som tjänsten gav dig inklusive webbadressen högst upp i webbläsaren och motsvarande från denna sida."
      ]
    },
    {
      "type": "AUTHENTICATION_FAILURE",
      "header": "Inloggning misslyckades",
      "body": [
        "Ett fel uppstod i tjänsten du försökte nå i samband med inloggning.",
        "Detta kan bero på att ytterligare steg krävs vid inloggning, till exempel användning av tvåfaktorsinloggning. Vänligen försök igen.",
        "Om du inte lyckas lösa problemet, kontakta KTH IT-Support och ange vilken tjänst du försökte nå, eventuella felmeddelande du fick samt, om möjligt, en skärmdump med felmeddelandena inklusive webbadressen högst upp i webbläsaren och motsvarande från denna sida."
      ]
    },
    {
      "type": "AUTHORIZATION_FAILURE",
      "header": "Behörighet saknas",
      "body": [
        "Du saknar behörighet till tjänsten du försökte nå.",
        "Typiska behörighetskrav:",
        "<b>En <i>bekräftad</i> användare, även kallad SWAMID AL2</b>",
        "<b>Association till organisationen (även kallat affiliation)</b>",
        "<b>En specifik behörighet (även kallat entitlement)</b>",
        "Om du anser att du ska ha behörighet till tjänsten, kontakta KTH IT-Support och ange vilken tjänst du försökte nå, vilka behörigheter du anser du ska ha, eventuella felmeddelande du fick samt, om möjligt, en skärmdump med felmeddelandena inklusive webbadressen högst upp i webbläsaren och motsvarande från denna sida."
      ],
      "context": [
        {
          "type": "verified",
          "identifiers": [
            "http://www.swamid.se/policy/assurance/al3",
            "https://refeds.org/assurance/IAP/high",
            "https://refeds.org/assurance/profile/espresso"
          ],
          "header": "Verifierad användare krävs",
          "body": [
            "Tjänsten du försökte nå kräver en <i>verifierad</i> användare, även kallad SWAMID AL3.",
            "KTH är i dagsläget inte en godkänd leverantör av SWAMID AL3. Kontakta KTH IT-Support eller försök med en annan identitetsleverantör, t.ex. eduID Sweden."
          ]
        },
        {
          "type": "confirmed",
          "identifiers": [
            "http://www.swamid.se/policy/assurance/al2",
            "https://refeds.org/assurance/IAP/medium",
            "https://refeds.org/assurance/profile/cappuccino"
          ],
          "header": "Bekräftad användare krävs",
          "body": [
            "Tjänsten du försökte nå kräver en <i>bekräftad</i> användare, även kallad SWAMID AL2.",
            "Läs instruktionerna under rubriken &quot;Vad innebär det för dig?&quot; på sidan <a href=\"https://intra.kth.se/utbildning/systemstod/ladok/forhojd-sakerhetsniva-for-inloggning-i-ladok-1.1225312\">Förhöjd säkerhetsnivå för inloggning i Ladok</a>."
          ]
        },
        {
          "type": "non-confirmed",
          "identifiers": [
            "http://www.swamid.se/policy/assurance/al1",
            "https://refeds.org/assurance/IAP/low"
          ],
          "header": "SWAMID basnivå krävs",
          "body": [
            "Tjänsten du försökte nå kräver en användare som uppfyller SWAMID:s <i>basnivå</i>, även kallad SWAMID AL1.",
            "Alla konton på KTH uppfyller AL1.",
            "Kontakta KTH IT-Support och ange vilken tjänst du försökte nå, eventuella felmeddelande du fick samt, om möjligt, en skärmdump med felmeddelandena inklusive webbadressen högst upp i webbläsaren och motsvarande från denna sida."
          ]
        }
      ]
    },
    {
      "type": "OTHER_ERROR",
      "header": "Inloggningsproblem",
      "body": [
        "Ett fel uppstod vid inloggning i tjänsten.",
        "Om du tror att du ska kunna använda tjänsten, kontakta KTH IT-Support och ange vilken tjänst du försökte nå, eventuella felmeddelanden du fick samt, om möjligt, en skärmdump med felmeddelandena inklusive webbadressen högst upp i webbläsaren och motsvarande från denna sida."
      ]
    }
  ]
}
